In [1]:
import pandas as pd
import numpy as np

In [14]:
purchases = {
    'name': ['Chris', 'Kevin', 'Marley'],
    'item': ['Dog Food', 'Food', 'Food'],
    'cost': [22.50, 2.50, 5.00]
}

In [31]:
df = pd.DataFrame(purchases, index=[ 'Store 1', 'Store 1', 'Store 2' ])

In [32]:
df.head()

         cost      item    name
Store 1  22.5  Dog Food   Chris
Store 1   2.5      Food   Kevin
Store 2   5.0      Food  Marley

In [33]:
df['cost'].mean()

10.0

In [34]:
np.sum(df['cost'])

30.0

In [35]:
df.groupby(['item']).agg(['sum'])

          cost         name
           sum          sum
item
Dog Food  22.5        Chris
Food       7.5  KevinMarley

In [36]:
df.loc['Store 2']

cost         5
item      Food
name    Marley
Name: Store 2, dtype: object

In [84]:
from functools import reduce

def who_shops_at(store):
    # Notice the double brackets around store
    return reduce(lambda s,x: s + ', ' +x, df.loc[[store]]['name'])

In [98]:
print(who_shops_at('Store 1'))
print(who_shops_at('Store 2'))

# Double brackets returns a whole dataframe. Single brackets
# return a series if there's only a single value so who_shops_at
# would return M, a, r, l, e, y for Store 2 if a dataframe wasn't always provided
print(type(df.loc[['Store 2']]))
print(type(df.loc['Store 2']))

Chris, Kevin
Marley
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [48]:
df.loc['Store 1', 'cost']

Store 1    22.5
Store 1     2.5
Name: cost, dtype: float64

In [49]:
df.T

       Store 1 Store 1 Store 2
cost      22.5     2.5       5
item  Dog Food    Food    Food
name     Chris   Kevin  Marley

In [55]:
# Returns a copy of the dataframe. Slow. Can be wrong when changing
df.loc['Store 1']['cost']

Store 1    22.5
Store 1     2.5
Name: cost, dtype: float64

In [62]:
# Try not to chain
df.loc[:,['name', 'cost']]

           name  cost
Store 1   Chris  22.5
Store 1   Kevin   2.5
Store 2  Marley   5.0

In [65]:
# Doesn't change the df although can use inplace=True
df.drop('Store 1')

         cost  item    name
Store 2   5.0  Food  Marley

In [66]:
df.head()

         cost      item    name
Store 1  22.5  Dog Food   Chris
Store 1   2.5      Food   Kevin
Store 2   5.0      Food  Marley

In [67]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')

In [68]:
copy_df

         cost  item    name
Store 2   5.0  Food  Marley

In [69]:
df

         cost      item    name
Store 1  22.5  Dog Food   Chris
Store 1   2.5      Food   Kevin
Store 2   5.0      Food  Marley

In [71]:
del copy_df['name']

In [72]:
copy_df

         cost  item
Store 2   5.0  Food

In [73]:
df['location'] = None

In [74]:
df['location'] = ['England', 'Wales', 'Ireland']

In [75]:
df

         cost      item    name location
Store 1  22.5  Dog Food   Chris  England
Store 1   2.5      Food   Kevin    Wales
Store 2   5.0      Food  Marley  Ireland

In [76]:
df[['cost', 'location']]

         cost location
Store 1  22.5  England
Store 1   2.5    Wales
Store 2   5.0  Ireland

In [107]:
df['cost'] *= 0.8

In [108]:
df['cost']

Store 1    14.4
Store 1     1.6
Store 2     3.2
Name: cost, dtype: float64